system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;
// application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

// endTime         20.0;
endTime         1.0;

// deltaT          0.01;
deltaT          2e-5;

writeControl    runTime;
// writeControl    adjustableRunTime;

// writeInterval   0.1;
writeInterval   1e-3;

purgeWrite      10;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo 0.5;

maxDeltaT 0.05;

// functions
// {
// }


// ************************************************************************* //
