system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }

    // U
    // {
    //     solver          PBiCGStab;
    //     preconditioner  DILU;
    //     tolerance       1e-6;
    //     relTol          0.1;
    // }

    // UFinal
    // {
    //     $U;
    //     relTol          0;
    // }
}

PISO
{
    momentumPredictor   yes;
    nCorrectors         2;
    nNonOrthogonalCorrectors    1;
    // pRefPoint   (0 0 0);
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
    $PISO;
    nOuterCorrectors    1;

    residualControl
    {
        p
        {
            relTol          0.01;
            tolerance       0;
        }
        U
        {
            relTol          0.01;
            tolerance       0;
        }
    }
}

relaxationFactors
{
    fields
    {
        ".*"    1.0;
    }
    equations
    {
        ".*"    1.0;
    }
}


// ************************************************************************* //
