system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

        // constants
        // {
        // }

        variables
        (
            "ReTau = 295"
            "nu = 1e-6"
            "delta = 2e-3"
            "uTau = ReTau*nu/delta"
            "r = sqrt(sqr(pos().x()) + sqr(pos().y()))"
            "y = delta - r"
            "theta = atan2(pos().y(), pos().x())"
            "yPlus = y/delta * ReTau"
            "kappa = 0.436"
            "B = 6.13"
            "uLamPlus = yPlus"
            "uTurbPlus = log(yPlus) / kappa + B"
            "a = 0.01"
            "b = 5.0"
            "Gamma = - a * pow(yPlus,4) / (1 + b*yPlus)"
            "uPlus = exp(Gamma)*uLamPlus + exp(pow(Gamma,-1))*uTurbPlus"
            "sqrt_uu = uTau * sqrt(1 + 1.5*yPlus*exp(-yPlus/12))"
            "sqrt_ww = uTau * sqrt(1 + 0.1*yPlus*exp(-yPlus/26))"
            "fluctuation = (rand(12345) - 0.5) * 3"
        );

        // fieldMask
        // #{
        // #};

        expression
        #{
            vector(-sin(theta)*sqrt_ww*fluctuation, cos(theta)*sqrt_ww*fluctuation, uPlus*uTau + sqrt_uu*fluctuation)
         #};
    }
);

// ************************************************************************* //
